Autodesk.Revit.DB.NumberingParameterType
Defines types for numbering parameter associations.
Since:
2027
Since:
2027

Autodesk.Revit.DB.NumberingParameterType.Unknown
The parameter does not belong to any associations for this category.

Autodesk.Revit.DB.NumberingParameterType.Room
The parameter belongs to the room contains that element.

Autodesk.Revit.DB.NumberingParameterType.StructuralMaterial
The parameter belongs to the structural material associated with this element.

Autodesk.Revit.DB.NumberingParameterType.StructuralSection
The parameter belongs to the structural section associated with this element.

Autodesk.Revit.DB.NumberingParameterType.Physical
The parameter belongs to the physical element associated with this element.

Autodesk.Revit.DB.NumberingParameterType.ToRoom
The parameter belongs to the room that associates this element as an in.

Autodesk.Revit.DB.NumberingParameterType.FromRoom
The parameter belongs to the room that associates this element as an out.

Autodesk.Revit.DB.NumberingParameterType.MemberForces
The parameter belongs to the member force element associated with this element.

Autodesk.Revit.DB.NumberingParameterType.Analytical
The parameter belongs to the analytical element associated with this element.

Autodesk.Revit.DB.NumberingParameterType.Native
The parameter belongs to the element or to the type of the element.